tiborsimon/embedded-tdd-headers/pic/8bit/pic18f97j94_tdd.h
#define LCDDATA60                     1649
#define S32C7                         1650
#define S33C7                         1651
#define S34C7                         1652
#define S35C7                         1653
#define S36C7                         1654
#define S37C7                         1655
#define S38C7                         1656
#define S39C7                         1657
#define LCDDATA61                     1658
#define S40C7                         1659
#define S41C7                         1660
#define S42C7                         1661
#define S43C7                         1662
#define S44C7                         1663
#define S45C7                         1664
#define S46C7                         1665
#define S47C7                         1666
#define LCDDATA62                     1667
#define S48C7                         1668
#define S49C7                         1669
#define S50C7                         1670
#define S51C7                         1671
#define S52C7                         1672
#define S53C7                         1673
#define S54C7                         1674
#define S55C7                         1675
#define LCDDATA63                     1676
#define S56C7                         1677
#define S57C7                         1678
#define S58C7                         1679
#define S59C7                         1680
#define S60C7                         1681
#define S61C7                         1682
#define S62C7                         1683
#define S63C7                         1684
#define LCDSE0                        1685
#define SE00                          1686
#define SE01                          1687
#define SE02                          1688
#define SE03                          1689
#define SE04                          1690
#define SE05                          1691
#define SE06                          1692
#define SE07                          1693
#define LCDSE1                        1694
#define SE08                          1695
#define SE09                          1696
#define SE10                          1697
#define SE11                          1698
#define SE12                          1699
#define SE13                          1700
#define SE14                          1701
#define SE15                          1702
#define LCDSE2                        1703
#define SE16                          1704
#define SE17                          1705
#define SE18                          1706
#define SE19                          1707
#define SE20                          1708
#define SE21                          1709
#define SE22                          1710
#define SE23                          1711
#define LCDSE3                        1712
#define SE24                          1713
#define SE25                          1714
#define SE26                          1715
#define SE27                          1716
#define SE28                          1717
#define SE29                          1718
#define SE30                          1719
#define SE31                          1720
#define LCDSE4                        1721
#define SE32                          1722
#define SE33                          1723
#define SE34                          1724
#define SE35                          1725
#define SE36                          1726
#define SE37                          1727
#define SE38                          1728
#define SE39                          1729
#define LCDSE5                        1730
#define SE40                          1731
#define SE41                          1732
#define SE42                          1733
#define SE43                          1734
#define SE44                          1735
#define SE45                          1736
#define SE46                          1737
#define SE47                          1738
#define LCDSE6                        1739
#define SE48                          1740
#define SE49                          1741
#define SE50                          1742
#define SE51                          1743
#define SE52                          1744
#define SE53                          1745
#define SE54                          1746
#define SE55                          1747
#define LCDSE7                        1748
#define SE56                          1749
#define SE57                          1750
#define SE58                          1751
#define SE59                          1752
#define SE60                          1753
#define SE61                          1754
#define SE62                          1755
#define SE63                          1756
#define LCDRL                         1757
#define LRLAT0                        1758
#define LRLAT                         1759
#define LRLAT1                        1760
#define LRLAT2                        1761
#define LRLBP                         1762
#define LRLBP0                        1763
#define LRLBP1                        1764
#define LRLAP0                        1765
#define LRLAP                         1766
#define LRLAP1                        1767
#define LCDREF                        1768
#define VLCD1PE                       1769
#define VLCD2PE                       1770
#define VLCD3PE                       1771
#define LCDCST0                       1772
#define LCDCST                        1773
#define LCDCST1                       1774
#define LCDCST2                       1775
#define LCDIRE                        1776
#define LCDREG                        1777
#define CLKSEL                        1778
#define CLKSEL0                       1779
#define CLKSEL1                       1780
#define MODE13                        1781
#define BIAS0                         1782
#define BIAS                          1783
#define BIAS1                         1784
#define BIAS2                         1785
#define CPEN                          1786
#define LCDCON                        1787
#define LMUX0                         1788
#define LMUX                          1789
#define LMUX1                         1790
#define LMUX2                         1791
#define LCDCON_CS                     1792
#define CS0                           1793
#define CS1                           1794
#define WERR                          1795
#define SLPEN                         1796
#define LCDEN                         1797
#define LCDPS                         1798
#define LP                            1799
#define LP0                           1800
#define LP1                           1801
#define LP2                           1802
#define LP3                           1803
#define WA                            1804
#define LCDA                          1805
#define BIASMD                        1806
#define WFT                           1807
#define REFO2CON3                     1808
#define REFO2CON3_RODIV8              1809
#define REFO2CON3_RODIV               1810
#define REFO2CON3_RODIV9              1811
#define REFO2CON3_RODIV10             1812
#define REFO2CON3_RODIV11             1813
#define REFO2CON3_RODIV12             1814
#define REFO2CON3_RODIV13             1815
#define REFO2CON3_RODIV14             1816
#define REFO2CON2                     1817
#define REFO2CON2_RODIV               1818
#define REFO2CON2_RODIV0              1819
#define REFO2CON2_RODIV1              1820
#define REFO2CON2_RODIV2              1821
#define REFO2CON2_RODIV3              1822
#define REFO2CON2_RODIV4              1823
#define REFO2CON2_RODIV5              1824
#define REFO2CON2_RODIV6              1825
#define REFO2CON2_RODIV7              1826
#define REFO2CON1                     1827
#define REFO2CON1_ROSEL               1828
#define REFO2CON1_ROSEL0              1829
#define REFO2CON1_ROSEL1              1830
#define REFO2CON1_ROSEL2              1831
#define REFO2CON1_ROSEL3              1832
#define REFO2CON                      1833
#define REFO2CON_ACTIVE               1834
#define REFO2CON_DIVSWEN              1835
#define REFO2CON_ROSSLP               1836
#define REFO2CON_ROOE                 1837
#define REFO2CON_ROSIDL               1838
#define REFO2CON_ROON                 1839
#define REFO1CON3                     1840
#define REFO1CON3_RODIV8              1841
#define REFO1CON3_RODIV               1842
#define REFO1CON3_RODIV9              1843
#define REFO1CON3_RODIV10             1844
#define REFO1CON3_RODIV11             1845
#define REFO1CON3_RODIV12             1846
#define REFO1CON3_RODIV13             1847
#define REFO1CON3_RODIV14             1848
#define REFO1CON2                     1849
#define REFO1CON2_RODIV               1850
#define REFO1CON2_RODIV0              1851
#define REFO1CON2_RODIV1              1852
#define REFO1CON2_RODIV2              1853
#define REFO1CON2_RODIV3              1854
#define REFO1CON2_RODIV4              1855
#define REFO1CON2_RODIV5              1856
#define REFO1CON2_RODIV6              1857
#define REFO1CON2_RODIV7              1858
#define REFO1CON1                     1859
#define REFO1CON1_ROSEL               1860
#define REFO1CON1_ROSEL0              1861
#define REFO1CON1_ROSEL1              1862
#define REFO1CON1_ROSEL2              1863
#define REFO1CON1_ROSEL3              1864
#define REFO1CON                      1865
#define REFO1CON_ACTIVE               1866
#define REFO1CON_DIVSWEN              1867
#define REFO1CON_ROSSLP               1868
#define REFO1CON_ROOE                 1869
#define REFO1CON_ROSIDL               1870
#define REFO1CON_ROON                 1871
#define MEMCON                        1872
#define MEMCON_WM                     1873
#define MEMCON_WM0                    1874
#define MEMCON_WM1                    1875
#define WAIT0                         1876
#define WAIT                          1877
#define WAIT1                         1878
#define EBDIS                         1879
#define PORTL                         1880
#define RL0                           1881
#define RL1                           1882
#define RL2                           1883
#define RL3                           1884
#define RL4                           1885
#define RL5                           1886
#define RL6                           1887
#define RL7                           1888
#define LATL                          1889
#define LATL0                         1890
#define LATL1                         1891
#define LATL2                         1892
#define LATL3                         1893
#define LATL4                         1894
#define LATL5                         1895
#define LATL6                         1896
#define LATL7                         1897
#define TRISL                         1898
#define TRISL0                        1899
#define TRISL1                        1900
#define TRISL2                        1901
#define TRISL3                        1902
#define TRISL4                        1903
#define TRISL5                        1904
#define TRISL6                        1905
#define TRISL7                        1906
#define PORTK                         1907
#define RK0                           1908
#define RK1                           1909
#define RK2                           1910
#define RK3                           1911
#define RK4                           1912
#define RK5                           1913
#define RK6                           1914
#define RK7                           1915
#define LATK                          1916
#define LK0                           1917
#define LATK0                         1918
#define LK1                           1919
#define LATK1                         1920
#define LK2                           1921
#define LATK2                         1922
#define LK3                           1923
#define LATK3                         1924
#define LK4                           1925
#define LATK4                         1926
#define LK5                           1927
#define LATK5                         1928
#define LK6                           1929
#define LATK6                         1930
#define LK7                           1931
#define LATK7                         1932
#define TRISK                         1933
#define TRISK0                        1934
#define TRISK1                        1935
#define TRISK2                        1936
#define TRISK3                        1937
#define TRISK4                        1938
#define TRISK5                        1939
#define TRISK6                        1940
#define TRISK7                        1941
#define ODCON2                        1942
#define ECCP3OD                       1943
#define CCP4OD                        1944
#define CCP5OD                        1945
#define CCP6OD                        1946
#define CCP7OD                        1947
#define CCP8OD                        1948
#define CCP9OD                        1949
#define CCP10OD                       1950
#define ODCON1                        1951
#define SSP1OD                        1952
#define SSP2OD                        1953
#define USART1OD                      1954
#define USART2OD                      1955
#define USART3OD                      1956
#define USART4OD                      1957
#define ECCP1OD                       1958
#define ECCP2OD                       1959
#define MDCARL                        1960
#define MDCL0                         1961
#define MDCL                          1962
#define MDCL1                         1963
#define MDCL2                         1964
#define MDCL3                         1965
#define MDCLSYNC                      1966
#define MDCLPOL                       1967
#define MDCLODIS                      1968
#define MDCARH                        1969
#define MDCH                          1970
#define MDCH0                         1971
#define MDCH1                         1972
#define MDCH2                         1973
#define MDCH3                         1974
#define MDCHSYNC                      1975
#define MDCHPOL                       1976
#define MDCHODIS                      1977
#define MDSRC                         1978
#define MDSRC0                        1979
#define MDSRC1                        1980
#define MDSRC2                        1981
#define MDSRC3                        1982
#define MDSODIS                       1983
#define MDCON                         1984
#define MDBIT                         1985
#define MDO                           1986
#define MDOPOL                        1987
#define MDSLR                         1988
#define MDOE                          1989
#define MDEN                          1990
#define PMD4                          1991
#define PMD4_EMBMD                    1992
#define LVDMD                         1993
#define IOCMD                         1994
#define USBMD                         1995
#define CMP3MD                        1996
#define CMP2MD                        1997
#define CMP1MD                        1998
#define PMD3                          1999
#define REFO2MD                       2000
#define REFO1MD                       2001
#define PSPMD                         2002
#define LCDMD                         2003
#define RTCCMD                        2004
#define ADCMD                         2005
#define CTMUMD                        2006
#define TXMMD                         2007
#define MODMD                         2008
#define PMD2                          2009
#define TMR0MD                        2010
#define TMR1MD                        2011
#define TMR2MD                        2012
#define TMR3MD                        2013
#define TMR4MD                        2014
#define TMR5MD                        2015
#define TMR6MD                        2016
#define TMR8MD                        2017
#define PMD1                          2018
#define SSP1MD                        2019
#define PMD1_EMBMD                    2020
#define SSP2MD                        2021
#define UART1MD                       2022
#define UART2MD                       2023
#define UART3MD                       2024
#define UART4MD                       2025
#define ECCP1MD                       2026
#define ECCP2MD                       2027
#define PMD0                          2028
#define ECCP3MD                       2029
#define CCP4MD                        2030
#define SPI1MD                        2031
#define SPI2MD                        2032
#define CCP5MD                        2033
#define CCP6MD                        2034
#define CCP7MD                        2035
#define CCP8MD                        2036
#define CCP9MD                        2037
#define CCP10MD                       2038
#define CTMUCON4                      2039
#define EDG1STAT                      2040
#define EDG2STAT                      2041
#define EDG1SEL                       2042
#define EDG1SEL0                      2043
#define EDG1SEL1                      2044
#define EDG1SEL2                      2045
#define EDG1SEL3                      2046
#define EDG1POL                       2047
#define EDG1EN                        2048
#define CTMUCON3                      2049
#define EDG2SEL0                      2050
#define EDG2SEL                       2051
#define EDG2SEL1                      2052
#define EDG2SEL2                      2053
#define EDG2SEL3                      2054
#define EDG2POL                       2055
#define EDG2EN                        2056
#define CTMUCON2                      2057
#define IRNG                          2058
#define IRNG0                         2059
#define IRNG1                         2060
#define ITRIM0                        2061
#define ITRIM                         2062
#define ITRIM1                        2063
#define ITRIM2                        2064
#define ITRIM3                        2065
#define ITRIM4                        2066
#define ITRIM5                        2067
#define CTMUCON1                      2068
#define CTTRIG                        2069
#define IDISSEN                       2070
#define EDGSEQEN                      2071
#define EDGEN                         2072
#define TGEN                          2073
#define CTMUSIDL                      2074
#define CTMUCON1_CTMUEN               2075
#define TXREG4                        2076
#define RCREG4                        2077
#define SPBRG4_BRG0                   2078
#define SPBRG4                        2079
#define SPBRG4_BRG1                   2080
#define SPBRG4_BRG2                   2081
#define SPBRG4_BRG3                   2082
#define SPBRG4_BRG4                   2083
#define SPBRG4_BRG5                   2084
#define SPBRG4_BRG6                   2085
#define SPBRG4_BRG7                   2086
#define SPBRGH4                       2087
#define SPBRGH4_BRG8                  2088
#define SPBRGH4_BRG9                  2089
#define SPBRGH4_BRG10                 2090
#define SPBRGH4_BRG11                 2091
#define SPBRGH4_BRG12                 2092
#define SPBRGH4_BRG13                 2093
#define SPBRGH4_BRG14                 2094
#define SPBRGH4_BRG15                 2095
#define BAUDCON4                      2096
#define BAUDCON4_ABDEN                2097
#define BAUDCON4_WUE                  2098
#define BAUDCON4_IREN                 2099
#define BAUDCON4_BRG16                2100
#define BAUDCON4_TXCKP                2101
#define BAUDCON4_RXDTP                2102
#define BAUDCON4_RCIDL                2103
#define BAUDCON4_ABDOVF               2104
#define TXSTA4                        2105
#define TXSTA4_TX9D                   2106
#define TXSTA4_TRMT                   2107
#define TXSTA4_BRGH                   2108
#define TXSTA4_SENDB                  2109
#define TXSTA4_SYNC                   2110
#define TXSTA4_TXEN                   2111
#define TXSTA4_TX9                    2112
#define TXSTA4_CSRC                   2113
#define RCSTA4                        2114
#define RCSTA4_RX9D                   2115
#define RCSTA4_OERR                   2116
#define RCSTA4_FERR                   2117
#define RCSTA4_ADDEN                  2118
#define RCSTA4_CREN                   2119
#define RCSTA4_SREN                   2120
#define RCSTA4_RX9                    2121
#define RCSTA4_SPEN                   2122
#define DMACON2                       2123
#define INTLVL0                       2124
#define INTLVL                        2125
#define INTLVL1                       2126
#define INTLVL2                       2127
#define INTLVL3                       2128
#define DLYCYC                        2129
#define DLYCYC0                       2130
#define DLYCYC1                       2131
#define DLYCYC2                       2132
#define DLYCYC3                       2133
#define ANCFG                         2134
#define VBGEN                         2135
#define VBG2EN                        2136
#define VBG6EN                        2137
#define SSP2ADD                       2138
#define MSK02                         2139
#define SSP2ADD_SSPADD                2140
#define MSK12                         2141
#define MSK22                         2142
#define MSK32                         2143
#define MSK42                         2144
#define MSK52                         2145
#define MSK62                         2146
#define MSK72                         2147
#define SSP2BUF                       2148
#define SSP2BUF_SSPBUF                2149
#define T4CON                         2150
#define T4CKPS0                       2151
#define T4CKPS                        2152
#define T4CKPS1                       2153
#define TMR4ON                        2154
#define T4OUTPS                       2155
#define T4OUTPS0                      2156
#define T4OUTPS1                      2157
#define T4OUTPS2                      2158
#define T4OUTPS3                      2159
#define PR4                           2160
#define TMR4                          2161
#define CCP7CON                       2162
#define CCP7M0                        2163
#define CCP7M                         2164
#define CCP7M1                        2165
#define CCP7M2                        2166
#define CCP7M3                        2167
#define DC7B                          2168
#define CCP7Y                         2169
#define DC7B0                         2170
#define CCP7X                         2171
#define DC7B1                         2172
#define CCPR7L                        2173
#define CCPR7H                        2174
#define CCP6CON                       2175
#define CCP6M                         2176
#define CCP6M0                        2177
#define CCP6M1                        2178
#define CCP6M2                        2179
#define CCP6M3                        2180
#define CCP6Y                         2181
#define DC6B0                         2182
#define DC6B                          2183
#define DC6B1                         2184
#define CCP6X                         2185
#define CCPR6L                        2186
#define CCPR6H                        2187
#define CCP5CON                       2188
#define CCP5M0                        2189
#define CCP5M                         2190
#define CCP5M1                        2191
#define CCP5M2                        2192
#define CCP5M3                        2193
#define CCP5Y                         2194
#define DC5B0                         2195
#define DC5B                          2196
#define CCP5X                         2197
#define DC5B1                         2198
#define CCPR5L                        2199
#define CCPR5H                        2200
#define CCP4CON                       2201
#define CCP4M                         2202
#define CCP4M0                        2203
#define CCP4M1                        2204
#define CCP4M2                        2205
#define CCP4M3                        2206
